# SQLAlchemy: SQL and ORM

We will follow a series of exercises to get familiar with SQL and ORM.

ORM can be an abstract concept, to help you compare, the exercises will be a combination of traditional queries and SQLAlchemy queries.

`SQLAlchemy` is the Python SQL toolkit and Object Relational Mapper that gives application developers the full power and flexibility of SQL.

It provides a full suite of well known enterprise-level persistence patterns, designed for efficient and high-performing database access, adapted into a simple and Pythonic domain language.

Installing The Package:

```pip install sqlalchemy```

## Setting up your notebook
To facilitate developing, you can run this notebook on a [Google Colab](https://colab.research.google.com/).

In [1]:
# Load the SQL magic extension
# https://github.com/ploomber/jupysql
# this extension allows us to connect to DBs and issue SQL commands
%load_ext sql

Deploy FastAPI apps for free on Ploomber Cloud! Learn more: https://ploomber.io/s/signup

In [2]:
# To run SQL code in a Jupyter notebook cell, you can use the magic command %%sql

In [3]:
%%sql
SELECT sqlite_version();

UsageError: No active connection.

To fix it:

Pass a valid connection string:
    Example: %sql postgresql://username:password@hostname/dbname

OR

Set the environment variable $DATABASE_URL

For more details, see: https://jupysql.ploomber.io/en/latest/connecting.html
If you need help solving this issue, send us a message: https://ploomber.io/community

After running the previous cell, we encounter the error `UsageError: No active connection.` This is due to the fact a connection with a database has not been established.

## Create a database with SQL Alchemy

The ***Declarative Mapping*** is the typical way that mappings are constructed in modern SQLAlchemy. Read more: [Declarative mapping and alternatives](https://docs.sqlalchemy.org/en/14/orm/mapping_styles.html#orm-declarative-mapping).

In [5]:
from sqlalchemy import Column, Integer, String, ForeignKey
from sqlalchemy.orm import declarative_base
from sqlalchemy import create_engine
from sqlalchemy.orm import sessionmaker

# declarative base class
Base = declarative_base()

# an example mapping using the base
class User(Base):
    __tablename__ = 'user'

    id = Column(Integer, primary_key=True)
    name = Column(String)
    fullname = Column(String)
    nickname = Column(String)

The `Engine` is the starting point for any SQLAlchemy application, it represents a Python object that can be used to interact directly with the database and can be passed to a Session object to work with the ORM,引擎 "是任何 SQLAlchemy 应用程序的起点，它代表一个 Python 对象，可用于直接与数据库交互，也可传递给会话对象以与 ORM 协同工作、

函数 `create_engine()` 根据 URL 生成一个 `Engine` 对象。
The `create_engine()`  function produces an `Engine` object based on a URL.

In [6]:
engine = create_engine('sqlite:///MyDataBase.db')

*Note the use of `///` to indicate a relative file path.*

In [7]:
print(type(engine))

<class 'sqlalchemy.engine.base.Engine'>

The typical form of a database URL is:.数据库 URL 的典型形式是    `dialect+driver://username:password@host:port/database`

In this case we are using [SQLite](https://www.sqlite.org/index.html) a database engine broadly used worldwide for desktop and mobile aplications and provides the advantage of containing the database into one file `DB.db`.
在本例中，我们使用的是 [SQLite](https://www.sqlite.org/index.html)，这是一种在全球范围内广泛用于桌面和移动应用程序的数据库引擎，其优点是可将数据库包含在一个文件 `DB.db` 中。

Among the supported databases on sql alchemy we can list:在 sql alchemy 支持的数据库中，我们可以列出

- SQLite
- PosgreSQL
- MySQL
- 甲骨文
- 微软 SQL 服务器

表对象 “是称为 ”元数据 "的更大集合中的一个成员。使用声明式时，该对象可通过声明式基类的 `.metadata attribute` 获得。

MetaData "是一个注册表，其中包括向数据库发送一组有限的模式生成命令的功能。由于我们的数据库实际上并不存在用户表，因此我们可以使用 `MetaData` 为所有尚未存在的表向数据库发出 CREATE TABLE 语句。

- SQLite
- PosgreSQL
- MySQL
- Oracle
- Microsoft SQL Server

The `Table object` is a member of a larger collection known as `MetaData`. When using Declarative, this object is available using the `.metadata attribute` of our declarative base class.

The `MetaData` is a registry which includes the ability to emit a limited set of schema generation commands to the database. As our database does not actually have a users table present, we can use `MetaData` to issue CREATE TABLE statements to the database for all tables that don’t yet exist.

In [8]:
# Create database following parameters defined in `Base`
Base.metadata.create_all(engine)

Refresh local files of your working directory, now you should be able to see the file `MyDataBase.db`.刷新工作目录下的本地文件，现在应该可以看到文件 `MyDataBase.db`。

In [9]:
# Connecting to the database
%sql sqlite:///MyDataBase.db

In [10]:
%%sql
-- hi
-- # In SQL the comments are declared with --
-- # Example: Query to select values on table "user" from MyDataBase.db
SELECT * FROM user;

Running query in 'sqlite:///MyDataBase.db'

+----+---------------+-----------------------+----------------+
| id |      name     |        fullname       |    nickname    |
+----+---------------+-----------------------+----------------+
| 1  |     Arnold    | Arnold Schwarzenegger |   Terminator   |
| 2  |    Jennifer   |    Jennifer Aniston   |     Rachel     |
| 3  | Tyrannosaurus |   Tyrannosaurus Rex   |     T-Rex      |
| 4  |      Neil     |  Neil Patrick Harris  | Barney Stinson |
| 5  |     Aegon     |    Aegon Targaryen    |   John Snow    |
+----+---------------+-----------------------+----------------+

The table `user` declared previously on `class User(Base)` exist on the database but no data has been stored yet.

# Database sessions

A `DBSession()` instance establishes all conversations with the database during your session. 
- Any change made against the objects in the session won't be persisted into the database until you call: `session.commit()`. *(just like using Git...)*

- If you're not happy about the changes, you can revert all of them back to the last commit by calling `session.rollback()`.

In [11]:
# Bind the engine to the metadata of the Base class so that the
# declaratives can be accessed through a DBSession instance
Base.metadata.bind = engine
DBSession = sessionmaker(bind=engine)
session = DBSession()

## Insert information into table *ORM approach*

In [12]:
# Using `class User(Base)` to input new parameters into the table `user`
my_first_table = User(name="Arnold", fullname="Arnold Schwarzenegger", nickname="Terminator")

In [13]:
# Add and commit changes to table `user`
session.add(my_first_table)
session.commit()
print(my_first_table)

<__main__.User object at 0x00000213B00AAEA0>

`my_first_table` is a Python object, what means we can interact with the table in the same way done with other functions:

In [14]:
print(my_first_table.id)
print(my_first_table.name)
print(my_first_table.fullname)
print(my_first_table.nickname)

6
Arnold
Arnold Schwarzenegger
Terminator

## Insert information to table *using Queries*

Instead of using `class User(Base)`, we will add the values to the table using directly SQL queries. This, with the purpose of ilustrate with a pragmatical example the working methods using ORM vs SQL queries.

In [15]:
%%sql

-- # Insert values into the table `user`

INSERT INTO user(id, name, fullname, nickname)
    VALUES (2, 'Jennifer', 'Jennifer Aniston', 'Rachel'), 
    (3, 'Tyrannosaurus','Tyrannosaurus Rex', 'T-Rex'), 
    (4, 'Neil', 'Neil Patrick Harris', 'Barney Stinson'),
    (5, 'Aegon', 'Aegon Targaryen', 'John Snow');

Running query in 'sqlite:///MyDataBase.db'

RuntimeError: (sqlite3.IntegrityError) UNIQUE constraint failed: user.id
[SQL: INSERT INTO user(id, name, fullname, nickname)
    VALUES (2, 'Jennifer', 'Jennifer Aniston', 'Rachel'),
    (3, 'Tyrannosaurus','Tyrannosaurus Rex', 'T-Rex'),
    (4, 'Neil', 'Neil Patrick Harris', 'Barney Stinson'),
    (5, 'Aegon', 'Aegon Targaryen', 'John Snow');]
(Background on this error at: https://sqlalche.me/e/20/gkpj)
If you need help solving this issue, send us a message: https://ploomber.io/community

To check your information was inserted correctly you can open your database or use one of the many VSCode extentions to view SQLite databases (e.g. SQL Viewer).

## Exercises:   
1. Use the `class User` to insert 5 rows of data into the table `user`    1 使用 "lass User "  在表 “user ”   中插入      5 行数据

2. Insert 5 additional rows but this time using queries                    2. 再插入 5 行，但这次使用查询

## I do my exercice : ( Your code: ORM Approach)
## Part 1. Use the `class User` to insert 5 rows of data into the table `user`    1 使用 "lass User "  在表 “user ”   中插入      5 行数据

In [17]:
from sqlalchemy import Column, Integer, String, create_engine
from sqlalchemy.orm import declarative_base, sessionmaker

# declarative base class
Base = declarative_base()

# an example mapping using the base
class User(Base):
    __tablename__ = 'user'

    id = Column(Integer, primary_key=True)
    name = Column(String)
    fullname = Column(String)
    nickname = Column(String)

# Creating the SQLite engine
engine = create_engine('sqlite:///MyDataBase.db')

# Create all tables in the engine (if they don't exist)
Base.metadata.create_all(engine)

# Bind the engine to the metadata of the Base class so that the declaratives can be accessed through a DBSession instance
Base.metadata.bind = engine
DBSession = sessionmaker(bind=engine)
session = DBSession()

# Insert 5 rows of data using the User class
users = [
    User(name="Bruce", fullname="Bruce Wayne", nickname="Batman"),
    User(name="Clark", fullname="Clark Kent", nickname="Superman"),
    User(name="Diana", fullname="Diana Prince", nickname="Wonder Woman"),
    User(name="Barry", fullname="Barry Allen", nickname="The Flash"),
    User(name="Arthur", fullname="Arthur Curry", nickname="Aquaman"),
]

# Add all instances to the session and commit
session.add_all(users)
session.commit()

# Querying the table to check the inserted data
for user in session.query(User).all():
    print(user.id, user.name, user.fullname, user.nickname)

1 Arnold Arnold Schwarzenegger Terminator
2 Jennifer Jennifer Aniston Rachel
3 Tyrannosaurus Tyrannosaurus Rex T-Rex
4 Neil Neil Patrick Harris Barney Stinson
5 Aegon Aegon Targaryen John Snow
6 Arnold Arnold Schwarzenegger Terminator
7 Bruce Bruce Wayne Batman
8 Clark Clark Kent Superman
9 Diana Diana Prince Wonder Woman
10 Barry Barry Allen The Flash
11 Arthur Arthur Curry Aquaman

## I do my exercice :  --# Your code: Using SQL Queries
## Part 2: Insert 5 additional rows using SQL queries

In [20]:
%%sql

INSERT INTO user (name, fullname, nickname) VALUES 
('Tony', 'Tony Stark', 'Iron Man'), 
('Steve', 'Steve Rogers', 'Captain America'), 
('Natasha', 'Natasha Romanoff', 'Black Widow'), 
('Bruce', 'Bruce Banner', 'Hulk'), 
('Thor', 'Thor Odinson', 'God of Thunder');

Running query in 'sqlite:///MyDataBase.db'

5 rows affected.

++
||
++
++

### Verification :
verify that all the data has been inserted by running a simple SELECT query:

In [26]:
%%sql
SELECT * FROM user LIMIT 10 OFFSET 0 ;

Running query in 'sqlite:///MyDataBase.db'

+----+---------------+-----------------------+----------------+
| id |      name     |        fullname       |    nickname    |
+----+---------------+-----------------------+----------------+
| 1  |     Arnold    | Arnold Schwarzenegger |   Terminator   |
| 2  |    Jennifer   |    Jennifer Aniston   |     Rachel     |
| 3  | Tyrannosaurus |   Tyrannosaurus Rex   |     T-Rex      |
| 4  |      Neil     |  Neil Patrick Harris  | Barney Stinson |
| 5  |     Aegon     |    Aegon Targaryen    |   John Snow    |
| 7  |     Bruce     |      Bruce Wayne      |     Batman     |
| 8  |     Clark     |       Clark Kent      |    Superman    |
| 9  |     Diana     |      Diana Prince     |  Wonder Woman  |
| 10 |     Barry     |      Barry Allen      |   The Flash    |
| 11 |     Arthur    |      Arthur Curry     |    Aquaman     |
+----+---------------+-----------------------+----------------+
Truncated to displaylimit of 10.

In [27]:
%%sql
SELECT * FROM user LIMIT 10 OFFSET 10;

Running query in 'sqlite:///MyDataBase.db'

+----+---------+------------------+-----------------+
| id |   name  |     fullname     |     nickname    |
+----+---------+------------------+-----------------+
| 12 |   Tony  |    Tony Stark    |     Iron Man    |
| 13 |  Steve  |   Steve Rogers   | Captain America |
| 14 | Natasha | Natasha Romanoff |   Black Widow   |
| 15 |  Bruce  |   Bruce Banner   |       Hulk      |
| 16 |   Thor  |   Thor Odinson   |  God of Thunder |
| 17 |   Tony  |    Tony Stark    |     Iron Man    |
| 18 |  Steve  |   Steve Rogers   | Captain America |
| 19 | Natasha | Natasha Romanoff |   Black Widow   |
| 20 |  Bruce  |   Bruce Banner   |       Hulk      |
| 21 |   Thor  |   Thor Odinson   |  God of Thunder |
+----+---------+------------------+-----------------+
Truncated to displaylimit of 10.

In [23]:
%%sql
-- Example: Delete the duplicate entry with id=6
DELETE FROM user WHERE id = 6;

Running query in 'sqlite:///MyDataBase.db'

1 rows affected.

++
||
++
++

because i did insert 2 times , raw 17 to 21 duplicated , 
1 Identify the Duplicates:
2 Delete the Duplicates:

In [29]:
%%sql

DELETE FROM user
WHERE id IN (
    SELECT id FROM (
        SELECT id,
               ROW_NUMBER() OVER (PARTITION BY name, fullname, nickname ORDER BY id) AS rn
        FROM user
    ) t
    WHERE t.rn > 1
);

Running query in 'sqlite:///MyDataBase.db'

5 rows affected.

++
||
++
++

In [30]:
%%sql 

SELECT * FROM user ORDER BY id;

Running query in 'sqlite:///MyDataBase.db'

+----+---------------+-----------------------+----------------+
| id |      name     |        fullname       |    nickname    |
+----+---------------+-----------------------+----------------+
| 1  |     Arnold    | Arnold Schwarzenegger |   Terminator   |
| 2  |    Jennifer   |    Jennifer Aniston   |     Rachel     |
| 3  | Tyrannosaurus |   Tyrannosaurus Rex   |     T-Rex      |
| 4  |      Neil     |  Neil Patrick Harris  | Barney Stinson |
| 5  |     Aegon     |    Aegon Targaryen    |   John Snow    |
| 7  |     Bruce     |      Bruce Wayne      |     Batman     |
| 8  |     Clark     |       Clark Kent      |    Superman    |
| 9  |     Diana     |      Diana Prince     |  Wonder Woman  |
| 10 |     Barry     |      Barry Allen      |   The Flash    |
| 11 |     Arthur    |      Arthur Curry     |    Aquaman     |
+----+---------------+-----------------------+----------------+
Truncated to displaylimit of 10.

In [31]:
%%sql
SELECT * FROM user LIMIT 10 OFFSET 10;

Running query in 'sqlite:///MyDataBase.db'

+----+---------+------------------+-----------------+
| id |   name  |     fullname     |     nickname    |
+----+---------+------------------+-----------------+
| 12 |   Tony  |    Tony Stark    |     Iron Man    |
| 13 |  Steve  |   Steve Rogers   | Captain America |
| 14 | Natasha | Natasha Romanoff |   Black Widow   |
| 15 |  Bruce  |   Bruce Banner   |       Hulk      |
| 16 |   Thor  |   Thor Odinson   |  God of Thunder |
+----+---------+------------------+-----------------+

## Preview values in table

You can also preview the values in a particular table by using queries and the ORM approach.
预览表中的值       您还可以使用  查询 和 ORM 方法  预览    特定表中的 值。

### *Using queries:*

In [32]:
%%sql

SELECT * FROM user;

Running query in 'sqlite:///MyDataBase.db'

+----+---------------+-----------------------+----------------+
| id |      name     |        fullname       |    nickname    |
+----+---------------+-----------------------+----------------+
| 1  |     Arnold    | Arnold Schwarzenegger |   Terminator   |
| 2  |    Jennifer   |    Jennifer Aniston   |     Rachel     |
| 3  | Tyrannosaurus |   Tyrannosaurus Rex   |     T-Rex      |
| 4  |      Neil     |  Neil Patrick Harris  | Barney Stinson |
| 5  |     Aegon     |    Aegon Targaryen    |   John Snow    |
| 7  |     Bruce     |      Bruce Wayne      |     Batman     |
| 8  |     Clark     |       Clark Kent      |    Superman    |
| 9  |     Diana     |      Diana Prince     |  Wonder Woman  |
| 10 |     Barry     |      Barry Allen      |   The Flash    |
| 11 |     Arthur    |      Arthur Curry     |    Aquaman     |
+----+---------------+-----------------------+----------------+
Truncated to displaylimit of 10.

### *ORM approach*:   ORM方法

The inspection module provides the `inspect()` function, which delivers runtime information about a wide variety of SQLAlchemy objects, both within the Core as well as the ORM.
检查模块提供了`inspect()`函数，该函数提供了关于各种 SQLAlchemy 对象的运行时信息，                                                                     既包括  核心对象，也包括   ORM 对象。

The `inspect()` function is the entry point to SQLAlchemy’s public API for viewing the configuration and construction of in-memory objects. Read more: https://docs.sqlalchemy.org/en/20/core/inspection.html.：inspect()` 函数是 SQLAlchemy 公共 API 的   入口点，  用于查看   内存对象的配置 和 构造

In [33]:
from sqlalchemy import inspect
inspector = inspect(engine)

# Get table information
print(inspector.get_table_names())

['media', 'user']

In [25]:
# Get values in table:

print("----> User by (name):")
query = session.query(User)
for _row in query.all():
    print(_row.id, _row.name, _row.fullname, _row.nickname)

----> User by (name):
1 Arnold Arnold Schwarzenegger Terminator
2 Jennifer Jennifer Aniston Rachel
3 Tyrannosaurus Tyrannosaurus Rex T-Rex
4 Neil Neil Patrick Harris Barney Stinson
5 Aegon Aegon Targaryen John Snow

### Exercises: 

1. Modify the code of the previous cell to stored the printed values on:

    a. A pandas DataFrame
    
    b. A dictionary

In [42]:
from sqlalchemy import inspect
import pandas as pd

# Assuming 'User' is defined and the session is active

# Get table information
inspector = inspect(engine)
print(inspector.get_table_names())

# Initialize lists to hold the data
data_list = []

# Query the data from the 'user' table
query = session.query(User)

# Store results in a list of dictionaries
for _row in query.all():
    data_list.append({
        'id': _row.id,
        'name': _row.name,
        'fullname': _row.fullname,
        'nickname': _row.nickname
    })

# a. Convert the list of dictionaries to a Pandas DataFrame
df = pd.DataFrame(data_list)
print("Data in DataFrame:")
print(df)

# b. Convert the list of dictionaries to a dictionary of lists
data_dict = {
    'id': [row['id'] for row in data_list],
    'name': [row['name'] for row in data_list],
    'fullname': [row['fullname'] for row in data_list],
    'nickname': [row['nickname'] for row in data_list],
}
print("\nData in Dictionary:")
print(data_dict)

['media', 'user']
Data in DataFrame:
    id           name               fullname         nickname
0    1         Arnold  Arnold Schwarzenegger       Terminator
1    2       Jennifer       Jennifer Aniston           Rachel
2    3  Tyrannosaurus      Tyrannosaurus Rex            T-Rex
3    4           Neil    Neil Patrick Harris   Barney Stinson
4    5          Aegon        Aegon Targaryen        John Snow
5    7          Bruce            Bruce Wayne           Batman
6    8          Clark             Clark Kent         Superman
7    9          Diana           Diana Prince     Wonder Woman
8   10          Barry            Barry Allen        The Flash
9   11         Arthur           Arthur Curry          Aquaman
10  12           Tony             Tony Stark         Iron Man
11  13          Steve           Steve Rogers  Captain America
12  14        Natasha       Natasha Romanoff      Black Widow
13  15          Bruce           Bruce Banner             Hulk
14  16           Thor           Thor Odinson   God of Thunder

Data in Dictionary:
{'id': [1, 2, 3, 4, 5, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16], 'name': ['Arnold', 'Jennifer', 'Tyrannosaurus', 'Neil', 'Aegon', 'Bruce', 'Clark', 'Diana', 'Barry', 'Arthur', 'Tony', 'Steve', 'Natasha', 'Bruce', 'Thor'], 'fullname': ['Arnold Schwarzenegger', 'Jennifer Aniston', 'Tyrannosaurus Rex', 'Neil Patrick Harris', 'Aegon Targaryen', 'Bruce Wayne', 'Clark Kent', 'Diana Prince', 'Barry Allen', 'Arthur Curry', 'Tony Stark', 'Steve Rogers', 'Natasha Romanoff', 'Bruce Banner', 'Thor Odinson'], 'nickname': ['Terminator', 'Rachel', 'T-Rex', 'Barney Stinson', 'John Snow', 'Batman', 'Superman', 'Wonder Woman', 'The Flash', 'Aquaman', 'Iron Man', 'Captain America', 'Black Widow', 'Hulk', 'God of Thunder']}

2. Insert new table using queries

In [43]:
%%sql

CREATE TABLE media (
    id          INTEGER PRIMARY KEY NOT NULL,
    production  TEXT NOT NULL,
    year        NUMBER NOT NULL
    );

Running query in 'sqlite:///MyDataBase.db'

RuntimeError: (sqlite3.OperationalError) table media already exists
[SQL: CREATE TABLE media (
    id          INTEGER PRIMARY KEY NOT NULL,
    production  TEXT NOT NULL,
    year        NUMBER NOT NULL
    );]
(Background on this error at: https://sqlalche.me/e/20/e3q8)
If you need help solving this issue, send us a message: https://ploomber.io/community

In [44]:
%%sql
--# Insert values on table `media`
INSERT INTO media(id, production, year)
    VALUES (1,'Terminator',1984), 
    (2,'Friends', 1994), 
    (3,'Toy Story', 1995), 
    (4,'How I met your mother', 2005),
    (5,'Game of thrones',2011);

Running query in 'sqlite:///MyDataBase.db'

RuntimeError: (sqlite3.IntegrityError) UNIQUE constraint failed: media.id
[SQL: INSERT INTO media(id, production, year)
    VALUES (1,'Terminator',1984),
    (2,'Friends', 1994),
    (3,'Toy Story', 1995),
    (4,'How I met your mother', 2005),
    (5,'Game of thrones',2011);]
(Background on this error at: https://sqlalche.me/e/20/gkpj)
If you need help solving this issue, send us a message: https://ploomber.io/community

In [45]:
%%sql

SELECT * FROM media;

Running query in 'sqlite:///MyDataBase.db'

+----+-----------------------+------+
| id |       production      | year |
+----+-----------------------+------+
| 1  |       Terminator      | 1984 |
| 2  |        Friends        | 1994 |
| 3  |       Toy Story       | 1995 |
| 4  | How I met your mother | 2005 |
| 5  |    Game of Thrones    | 2011 |
+----+-----------------------+------+

3. Complete the values on the table `media` that corresponds to your previous inputs on the table `user`.

In [ ]:
# Awesome code

In [47]:
%%sql
UPDATE media
SET production = 'Terminator', year = 1984
WHERE id = 1;

Running query in 'sqlite:///MyDataBase.db'

1 rows affected.

++
||
++
++

In [48]:
%%sql
UPDATE media
SET production = 'Friends', year = 1994
WHERE id = 2;

UPDATE media
SET production = 'Toy Story', year = 1995
WHERE id = 3;

UPDATE media
SET production = 'How I Met Your Mother', year = 2005
WHERE id = 4;

UPDATE media
SET production = 'Game of Thrones', year = 2011
WHERE id = 5;

Running query in 'sqlite:///MyDataBase.db'

1 rows affected.

1 rows affected.

1 rows affected.

1 rows affected.

++
||
++
++

In [49]:
%%sql
SELECT * FROM media;

Running query in 'sqlite:///MyDataBase.db'

+----+-----------------------+------+
| id |       production      | year |
+----+-----------------------+------+
| 1  |       Terminator      | 1984 |
| 2  |        Friends        | 1994 |
| 3  |       Toy Story       | 1995 |
| 4  | How I Met Your Mother | 2005 |
| 5  |    Game of Thrones    | 2011 |
+----+-----------------------+------+

### Well done! Now you have more tools as part of your skillset!

You are also ready for this joke: *An SQL query walks into a bar and sees two tables. He walks up to them and says:*

<img src='https://cdn.dribbble.com/users/1463678/screenshots/3212815/tables-dribbble.png' width = 500px></img>

## Resources:
- [Introduction to Relational Databases in Python (DataCamp)](https://app.datacamp.com/learn/courses/introduction-to-relational-databases-in-python)
- [ORM For Python: SQLAlchemy 101](https://medium.com/@haataa/orm-for-python-sqlalchemy-101-with-code-example-60868e65b0c)
- [Read the docs](https://docs.sqlalchemy.org/en/14/orm/mapping_styles.html)
- [Tutorial FastAPI and working with databases](https://fastapi.tiangolo.com/tutorial/sql-databases/)
- [SQL query practice](https://www.sql-practice.com/)
- [SQL workshop](https://tdmdal.github.io/mma-sql/)